# Date：2019/6/27 0027
# Name: 天然卷
# -*- coding:utf-8 -*-


#第一张
#[python] python2.x 3.x默认的编码格式分别是什么
# 2.x ASCII   3.x utf-8

#将"hello_new_world"按"_"符进行切割

"""
str = "hello_new_world"
print(str.split("_"))
"""

#将数字1以"0001"的格式输出到屏幕
"""
i = 1
print("%04d"%(i))
"""

#第二张
#1.字典a = {1: 1}是否正确
#不对key值必须为字符串
#2.请合并列表a = [1,2,3,4]和列表b = [5.6.4.7]
"""
a = [1, 2, 3, 4]
b = [5, 6, 7, 8]
a.extend(b)
print(a)
"""

#3.列表a,请写出实现正序排列，倒序排列，逆序排列的内置方法
# a = [1, 5, 9, 2, 3, 6]
# a.sort()
# a.reverse()
# a.sort(reverse=True)
# print(a)

#4.字典 d = {"k":1,"v":2},请写出d.items()结果
"""
d = {"k": 1, "v": 2}
for i, j in d.items():
    print(i, ":", j)
"""

#5.复杂列表[{"k":1,"v":2},{"k":12,"v":22},{"k":13,"v":32}],请用内置方法写出按k倒序排列的代码
"""
list1 = [{"k": 1, "v": 2}, {"k": 12, "v": 22}, {"k": 13, "v": 32}]
list1.sort(key=lambda x: x["k"], reverse=True)
print(list1)
"""

#6.集合s = set([1,2,3,4])，d = set([2,4,9,0,3]),请用内置方法写出他们交集，并集，对称差
"""
s = set([1, 2, 3, 4])
d = set([2, 4, 9, 0, 3])
set1 = s | d #并集
set2 = s & d #交集
set3 = s ^ d #对称差
print(set1)
print(set2)
print(set3)
"""

#7.如何把列表a = ["a", "b"]里的各项，转为字符串并用逗号"，"连接
"""
a = ["a", "b"]
b = ",".join(a)
print(b)
"""

#第三张
#1.判断下列描述是否正确，如果有错误，请指出错误的地方并改正。
"""
1.字典：具有键值映射关系，无序，字典的键不能重复并且可以是任意类型数据。
键必须是字符串
2.元祖：不能修改,无序，不能索引切片，当元祖中只有一个元素时，需要在元素的后面加逗号。
元祖有序，跟字符串相同下标索引都是从0开始，可以索引切片。
3.列表：元素可以重复，有序，不可以反向索引，元素可以是任意类型
列表可以反向索引
4.集合：元素不可以重复，可以索引，a = {}声明了一个空集合
要声明一个空集合必须用str（） a= {}是创建一个空字典
"""
#2.一行代码实现求1到100的和。
# print(sum(range(1, 101)))

#3.按下面要求写出完整代码：
#使用random.random方法实现随机输出范围在[25,60]中的浮点数(在胤大佬的帮助下完成)
"""
import  random
booll = True
while booll:
    num = random.random()
    new_num = num * 100
    if 28 <= new_num < 60:
        print(new_num)
        booll = False
    else:
        booll = True
"""

#第4张
#有一个list对象a = [1,2,4,3,2,2,4],需要去掉里面重复的值
"""
a = [1, 2, 4, 3, 2, 2, 4]
print(list(set(a)))
"""
